import React, { useContext, useEffect, useState } from 'react'
import { pages } from '../../../constants'
import { LocaleContext } from '../../../context/localeContext'
import { useQuery } from '../../../hooks'
import BreadCrumb from '../../core/BreadCrumb'
import SideBar from '../../core/SideBar'
import NewsFeed from './newsFeed'
import './style.scss'

const news = [
  {
    id: 1,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 2,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 3,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 4,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 5,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 6,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 7,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 8,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 9,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
  {
    id: 10,
    title_am: 'Նորության Անվանում',
    title_ru: 'Նորության Անվանում',
    title_en: 'Նորության Անվանում',
    describtion_am:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_ru:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
    describtion_en:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրովՀարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրո Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես ',
  },
]

const News = () => {
  const selectedNewsId = useQuery('news_id')
  const { locale } = useContext(LocaleContext)
  const [selected, setSelected] = useState(undefined)
  useEffect(() => {
    setSelected(selectedNewsId)
  }, [selectedNewsId])

  return (
    <div className="news_page_wrapper">
      <BreadCrumb
        title={pages.titles[`news_${locale}`]}
        path={[
          { title: pages.titles[`home_${locale}`], url: '/' },
          { title: pages.titles[`news_${locale}`], url: '/news' },
        ]}
      />
      <div className="main_news_page_container">
        <div className="main_news_wrapper">
          <NewsFeed {...{ selected, setSelected, news }} />
          <span>
            «Ֆիդես հիփոթեքային ընկերություն» ունիվերսալ վարկային
            կազմակերպություն փակ բաժնետիրական ընկերությունը (այսուհետ`
            Կազմակերպություն) ունի մեկ մասնաճյուղ:
          </span>
          <span>
            Կազմակերպության իրավաբանական հասցեն է` ՀՀ, ք. Երևան, Նաիրի Զարյան
            17ա: Կազմակերպության գործունեության հասցեն է` ԱՀ, ք. Ստեփանակերտ, Մ.
            Գոշ 2/33:
          </span>
        </div>
        <SideBar />
      </div>
    </div>
  )
}

export default React.memo(News)
