import newsImg from '../../../assets/img/newsImg.png'
export const news = [
  {
    title: 'Նորության Անվանում',
    content:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրով ... ',
    date: '12 Դեկտեմբեր 2022',
    status: '',
    img: newsImg,
    
  },
  {
    title: 'Նորության Անվանում',
    content:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրով ... ',
    date: '12 Դեկտեմբեր 2022',
    status: '',
    img: newsImg,
  },
  {
    title: 'Նորության Անվանում',
    content:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրով ... ',
    date: '12 Դեկտեմբեր 2022',
    status: '',
    img: newsImg,
  },
  {
    title: 'Նորության Անվանում',
    content:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրով ... ',
    date: '12 Դեկտեմբեր 2022',
    status: '',
    img: newsImg,
  },
  {
    title: 'Նորության Անվանում',
    content:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրով ... ',
    date: '12 Դեկտեմբեր 2022',
    status: '',
    img: newsImg,
  },
  {
    title: 'Նորության Անվանում',
    content:
      'Հարգելի  հաճախորդներ և գործընկերներ:«Ֆիդես հիփոթեքային ընկերություն» ՈՒՎԿ ՓԲԸ-ն սիրով ... ',
    date: '12 Դեկտեմբեր 2022',
    status: '',
    img: newsImg,
  },
]
